backend: "python"
max_batch_size: 8
input [{
    name: "text_input",
    data_type: TYPE_STRING,
    dims: [1]
}]

output [{
    name: "text_output",
    data_type: TYPE_STRING,
    dims: [1]
}]

model_transaction_policy {
    decoupled: true
}

dynamic_batching {

}

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/home/triton-server/micromamba/envs/ortllm/"}
}
