backend: "python"
parameters: {
	key: "huggingface_model",
	value: {string_value: "mistralai/Mistral-7B-v0.1"}
}
parameters: {
	key: "max_length",
	value: {string_value: "15"}
}

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
