name: "detection_preprocessing"
backend: "python"
max_batch_size: 256 
input [
{
    name: "detection_preprocessing_input"
    data_type: TYPE_UINT8
    dims: [ -1 ]
}
]
 
output [
{
    name: "detection_preprocessing_output"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3 ]
}
]

instance_group [{ kind: KIND_CPU }]
