name: "ensemble_model"
platform: "ensemble"
max_batch_size: 4

input [
    {
        name: "image"
        data_type: TYPE_FP32
        dims: [-1, -1, -1]
    }
]
output [
    {
        name: "last_hidden_state"
        data_type: TYPE_FP32
        dims: [-1, -1]
    },
    {
        name: "1519"
        data_type: TYPE_FP32
        dims: [768]
    }
]
ensemble_scheduling {
    step [
        {
            model_name: "preprocessing"
            model_version: 1
            input_map {
                key: "image"
                value: "image"
            }
            output_map {
                key: "pixel_values"
                value: "pixel_values"
            }
        },
        {
            model_name: "vit"
            model_version: 1
            input_map {
                key: "pixel_values"
                value: "pixel_values"
            }
            output_map {
                key: "last_hidden_state"
                value: "last_hidden_state"
            }
            output_map {
                key: "1519"
                value: "1519"
            }
        }
    ]
}
