name: "detection_postprocessing"
backend: "python"
max_batch_size: 256 
input [
{
    name: "detection_postprocessing_input_1"
    data_type: TYPE_FP32
    dims: [ -1, -1, 1 ]
},
{
    name: "detection_postprocessing_input_2"
    data_type: TYPE_FP32
    dims: [ -1, -1, 5 ]
},
{
    name: "detection_postprocessing_input_3"
    data_type: TYPE_FP32
    dims: [ -1, -1, 3 ]
}
]
 
output [
{
    name: "detection_postprocessing_output"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]
}
]

instance_group [{ kind: KIND_CPU }]

